authz_benchmark/jmeter_report/k8s_1ng_1j_3r_9600t_600e_6cpu_async2_https_http2/h2load.out
starting benchmark...
spawning thread #0: 9600 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 901.79s, 2748.75 req/s, 20.67MB/s
requests: 2473874 total, 2483474 started, 2473874 done, 2473874 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2473874 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 18.16GB (19503555155) total, 240.65MB (252335148) headers (space savings 32.00%), 17.84GB (19157680256) data
                     min         max         mean         sd        +/- sd
time for request:   161.08ms       5.02s       3.49s    218.96ms    84.53%
time for connect:   724.42ms       5.25s       2.88s       1.30s    59.24%
time to 1st byte:      4.28s      10.31s       6.05s       1.54s    60.81%
req/s           :       0.28        0.29        0.29        0.00    63.19%